---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsCurvetypeDefaultMechjointParam
source: html/193d3a4f-8b95-31aa-0d0c-358abde58148.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsCurvetypeDefaultMechjointParam Property

"Flange"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsCurvetypeDefaultMechjointParam { get; }
```